{"id":2336,"date":"2019-06-22T02:32:02","date_gmt":"2019-06-22T02:32:02","guid":{"rendered":"https:\/\/demoapus.com\/edumy-import\/?page_id=2336"},"modified":"2021-05-01T23:10:14","modified_gmt":"2021-05-01T23:10:14","slug":"about-us","status":"publish","type":"page","link":"https:\/\/www.imcohams.edu.ng\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"2336\" class=\"elementor elementor-2336\" data-elementor-settings=\"[]\">\n\t\t\t\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-51b5fb0 elementor-section-stretched elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"51b5fb0\" data-element_type=\"section\" data-settings=\"{&quot;stretch_section&quot;:&quot;section-stretched&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-extended\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-371e747\" data-id=\"371e747\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-9846b30 elementor-widget elementor-widget-edumy_heading\" data-id=\"9846b30\" data-element_type=\"widget\" data-widget_type=\"edumy_heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"edumy-heading-title edumy-size-default\">Our History<\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-2ee4cc3 elementor-widget elementor-widget-edumy_heading\" data-id=\"2ee4cc3\" data-element_type=\"widget\" data-widget_type=\"edumy_heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<div class=\"edumy-heading-title edumy-size-default\"><span style=\"font-family: Raleway;font-size: 16px\">The origin of this college is rooted in the vision of Chief Samuel Onunaka Mbakwe, the first Executive Governor of Imo state, to provide here in the heart of Igbo land, an institution for the training of manpower, in various fields of technology, so as to empower the people of Imo State and Nigeria to attain technological development.<\/span><br style=\"font-family: Raleway;font-size: 16px\"><span style=\"font-family: Raleway;font-size: 16px\">In 1981, Governor Sam Mbakwe, represented by his Commissioner for works, Chief Willy Onyejiaka, came to Amaigbo, to commission the king Jaja High School which the people of Amaigbo had built, and named after their legendary son, King Jaja of Opobo, whose ancestral home is Umuruduruoha, Amaigbo. Governor Mbakwe was so impressed with the infrastructure which Amaigbo had built for use as King Jaja High School, that he offered on behalf of Imo state Government to use same for the establishment of a College of Technology. The people of Amaigbo appreciated the offer, but insisted on keeping King Jaja High School in the already built premises. They however offered to provide land and buildings at an alternate site, if the Governor and the State were serious about the offer. The Government of Imo State true to her words, commenced immediately to prepare legislation for the establishment of the College and after the bill was signed into Law on February 4, 1983, the construction of the classrooms, lecture halls, dormitories and other facilities in accordance with the specifications of the State Government, started. The College advertised for the admission of her pioneer students in the Nigerian Statesman on the 18 th of November 1983, and resumed lectures in December 1983.<\/span><br style=\"font-family: Raleway;font-size: 16px\"><span style=\"font-family: Raleway;font-size: 16px\">The military coup of December, 1983 brought the school to a halt. The then Military Administrator of Imo state, Brigadier Ike Nwachukwu closed down the school and sent off the staff and students on the grounds that there was no money for their salaries. The campus became desolate for a period of nine years (1984-1993) and was grossly vandalized. The creation of Abia State in 1991 brought a ray of hope to the College. With the emergence of Abia state, Imo state had no College of Health Technology. The idea of transferring the Imo portion of the School of Health Aba to the campus of the College of Technology Amaigbo was presented to the authorities, and the then Military Governor of Imo state Navy Captain Amadi Ikwechegh approved it. The succeeding administrations also approved and provided funds for the take off of the school. The support from the Amaigbo community also contributed largely tothe renovation of the College.<\/span><\/div>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-0f2fdbe elementor-widget elementor-widget-edumy_heading\" data-id=\"0f2fdbe\" data-element_type=\"widget\" data-widget_type=\"edumy_heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<div class=\"edumy-heading-title edumy-size-default\"><span style=\"font-family: Raleway;font-size: 16px\">Like many other schools of Health Technology at that time, the school was ran as a parastatal under the Ministry of Health, the teaching and non teaching staff were seconded from the State Civil Service mostly from the Ministry of Health. All the programmes were purely middle level Health Professional Courses with accreditation by the respective regulatory bodies like the Community Health Practitioners Registration Board of Nigeria, Environmental Health Officers Registration Council of Nigeria, Medical Laboratory Science Council of Nigeria, Health Information Management Registration Board and Pharmacy Board of Nigeria. West African Health Examination Board (WAHEB) accredited the institution for examination of Environmental Health Professionals before Registration by their Regulatory Board.The school has passed through several name changes over the years aimed at repositioning it to suit the circumstances at each time. From School of Health Technology to College of Health Science and Technology, then in 2013, the institution witnessed yet another tremendous transformation with a change in name to IMO STATE COLLEGE OF NURSING AND HEALTH SCIENCES. By this the College of Health Science and Technology, Amaigbo was merged with the School of Nursing, Okporo with Amaigbo as the main campus. The State Assembly edict establishing this also made the College an Independent tertiary institution with powers to recruit academic and non academic staff without being tied to the apron string of the Ministry of Health. However, majority of the departments were due for re-accreditation as at 2013 by their respective regulatory bodies. This was more or less a crises period for the College. The Community Health Board, Medical Laboratory Science Council of Nigeria and Environmental Health Board finally withdrew their accreditation and barred the College from admitting students into these departments. WAHEB also stopped our students from writing Environmental Health examinations. The College was at cross roads.\nThis was the situation when His Excellency Owelle Rochas Okorocha appointed Dr Canice Chuma Duru as the Acting Provost of the College in October 2016. The College at this time witnessed another significant metamorphosis with the de-merging of the Institution from the College of Nursing, Okporo and the addition of Management Sciences, hence the name: Imo State College of Health and Management Sciences, Amaigbo. Dr Chuma Duru, an American trained seasoned Administrator and Academic calmly took off from the confused state of the College. His inaugural speech was re-assuring even when the entire staff were doubtful that the collapsed system could ever be redeemed. In his words, “I AM NOT ONLY QUALIFIED BUT ALSO DETERMINED TO SUCCEED”. To the chagrin of pundits and book makers, this College became a be-hive of academic activities once again. He besieged the assignment like a colossus. In quick succession, Dr Duru and his team of determined staff invited all the boards for re-accreditation visits at almost one month intervals. It sounded unrealistic to many.\nThe result will surprise you. In less than one year on seat, Dr Duru received letters of reaccreditation from: <\/span><\/div>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-6a45798 elementor-section-stretched elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"6a45798\" data-element_type=\"section\" data-settings=\"{&quot;stretch_section&quot;:&quot;section-stretched&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-extended\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-2ab563c\" data-id=\"2ab563c\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-6250e90 elementor-widget elementor-widget-edumy_heading\" data-id=\"6250e90\" data-element_type=\"widget\" data-widget_type=\"edumy_heading.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<h2 class=\"edumy-heading-title edumy-size-default\"><ul style=\"border: 0px;font-family: Raleway;font-size: 16px;font-weight: 400;margin-right: 0px;margin-bottom: 15px;margin-left: 20px;padding: 0px;vertical-align: baseline\"><li style=\"border: 0px;font-family: inherit;font-style: inherit;font-weight: inherit;margin: 0px;padding: 0px;vertical-align: baseline\">COMMUNITY HEALTH PRACTITIONERS REGISTRATION BOARD<\/li><li style=\"border: 0px;font-family: inherit;font-style: inherit;font-weight: inherit;margin: 0px;padding: 0px;vertical-align: baseline\">MEDICAL LABORATORY SCIENCE COUNCIL OF NIGERIA<\/li><li style=\"border: 0px;font-family: inherit;font-style: inherit;font-weight: inherit;margin: 0px;padding: 0px;vertical-align: baseline\">ENVIROMENTAL HEALTH OFFICERS REGISTRATION COUNCIL OF NIGERIA<\/li><li style=\"border: 0px;font-family: inherit;font-style: inherit;font-weight: inherit;margin: 0px;padding: 0px;vertical-align: baseline\">THE WEST AFRICAN HEALTH EXAMINATION BOARD (WAHEB)<\/li><\/ul><p style=\"border: 0px;font-family: Raleway;font-size: 16px;font-weight: 400;margin-bottom: 30px;padding: 0px;vertical-align: baseline\">concluded it’s near impossible accreditation visit to the College. The interim report was positive; the final result is being awaited.<br>Recall that the College had earlier obtained interim accreditation by NATIONAL BOARD FOR TECHNICAL EDUCATION (NBTE). The Environmental Health Officers Registration Board recently published a list of Colleges that have obtained accreditation from the NATIONAL BOARD FOR TECHNICAL EDUCATION (NBTE) as at 2018. Our dear College was conspicuously listed there.<br>The implication is that our College is listed by JAMB and that our graduands are qualified to participate in the NATIONAL YOUTH SERVICE CORPS (NYSC). Our students are also qualified to apply and obtain scholarships as other approved tertiary institutions in the country.<br>The recent introduction of Management Science courses like Computer Science expands the scope of the College and moves it from Monotechnic to Polytechnic status.<br><\/p><span style=\"font-family: Raleway;font-size: 16px;font-weight: 400\">The College has continued to explore other grounds to improve its services in other to produce highly skilled middle level technical manpower for the good people of Imo State, Nigeria and the World at large.<\/span><\/h2>\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-23ce8cb elementor-widget elementor-widget-text-editor\" data-id=\"23ce8cb\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-6434f05 elementor-widget elementor-widget-text-editor\" data-id=\"6434f05\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Our History The origin of this college is rooted in the vision of Chief Samuel Onunaka Mbakwe, the first Executive Governor of Imo state, to provide here in the heart of Igbo land, an institution for the training of manpower, in various fields of technology, so as to empower the people of Imo State and &hellip; <br \/><a href=\"https:\/\/www.imcohams.edu.ng\/about-us\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">About Us<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"_links":{"self":[{"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/pages\/2336"}],"collection":[{"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/comments?post=2336"}],"version-history":[{"count":18,"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/pages\/2336\/revisions"}],"predecessor-version":[{"id":4349,"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/pages\/2336\/revisions\/4349"}],"wp:attachment":[{"href":"https:\/\/www.imcohams.edu.ng\/wp-json\/wp\/v2\/media?parent=2336"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}